alimudena/INTAN-RHS2116/0 new common-port/port/MSP430FG479/functions/general_functions.c
#include <msp430.h>
#include <stdio.h>
#include <stdint.h>  // Necesario para uint16_t
#include "general_functions.h"

//Init MPS --> configure load caps
void init_MSP(){
    FLL_CTL0 |= XCAP14PF;                     // Configure load caps
}


//stop watchdog
void stop_wd(){
    WDTCTL = WDTPW + WDTHOLD; 
}

//*****************************************************************************
/*TOGGLE PIN*/
//*****************************************************************************

// toggle pin (for testing the leds attached)
void toggle_setup(){
    P4DIR |= BIT6;                            // Set P4.6 to output direction
}


void toggle_pin(){
    P4OUT ^= 0x40;                          // Toggle P4.6 using exclusive-OR
    
}

void OFF_pin(){
    P4OUT &= ~0x40;                          // Off   
}

void ON_pin(){                               // On 
    P4OUT |= 0x40;
}

//*****************************************************************************
/*error LED for INTAN*/
//*****************************************************************************

void INTAN_LED_setup(){
    P4DIR |= BIT3;                            // Set P4.3 to output direction
}

void OFF_INTAN_LED(){
    P4OUT &= ~0x08;                          // Off   
}

void ON_INTAN_LED(){                               // On 
    P4OUT |= 0x08;
}

//*****************************************************************************
/*CS for INTAN*/
//*****************************************************************************

void CS_setup(){
    P4DIR |= BIT4;                            // Set P4.4 to output direction
}

void ON_CS_pin(){                               // On 
    P4OUT |= 0x10;
}

void OFF_CS_pin(){
    P4OUT &= ~0x10;                          // Off   
}

//*****************************************************************************
/*CS for ESP32*/
//*****************************************************************************

void CS_ESP_setup(){
    P4DIR |= BIT2;                            // Set P4.2 to output direction
}

void ON_CS_ESP_pin(){                               // On 
    P4OUT |= 0x4;
}

void OFF_CS_ESP_pin(){
    P4OUT &= ~0x4;                          // Off   
}

//*****************************************************************************
/*Timing control from ESP32*/
//*****************************************************************************
void timing_control_ESP_init(){
    P1DIR &= ~BIT1;                             // P1.1 as input
}


bool timing_control_ESP(){
    return (P1IN & BIT1);
}

//*****************************************************************************
/*Stimulation enabler ESP32*/
//*****************************************************************************
void stimulation_enable_ESP_init(){
    P1DIR &= ~BIT4;                             // P1.4 as input
}


bool stimulation_enable_ESP(){
    return (P1IN & BIT4);
}


//*****************************************************************************
/*New parameters of stimulation from ESP32*/
//*****************************************************************************
void new_parameters_ESP_init(){
    P1DIR &= ~BIT5;                             // P1.5 as input
}


bool new_parameters_ESP(){
    return (P1IN & BIT5);
}


//*****************************************************************************
/*stim_en for INTAN*/
//*****************************************************************************

void stim_en_setup(){
    P4DIR |= BIT5;                            // Set P4.4 to output direction
}

void stim_en_ON(){                               // On 
    P4OUT |= 0x20;
}

void stim_en_OFF(){
    P4OUT &= ~0x20;                          // Off   
}


//*****************************************************************************
/*button_pressed for external ineraction*/
//*****************************************************************************
void button_init(){
    P1DIR &= ~BIT0;                             // P1.0 as input
}


bool button_pressed(){
    return !(P1IN & BIT0);
}
